package com.litecart.Task12;

/**
 * Created by pshynin on 12/18/16.
 */
public class NewProductTest {
//    Для добавления товара нужно открыть меню Catalog, в правом верхнем углу нажать кнопку "Add New Product",
//      заполнить поля с информацией о товаре и сохранить.
//    Достаточно заполнить только информацию на вкладках General, Information и Prices.
//      Скидки (Campains) на вкладке Prices можно не добавлять.
//    После сохранения товара нужно убедиться, что он появился в каталоге (в админке).
//      Клиентскую часть магазина можно не проверять.
}
