package com.litecart.task11;

/**
 * Created by pshynin on 12/14/16.
 */
public class RegistrationTest {

//    Сделайте сценарий для регистрации нового пользователя в учебном приложении litecart
//    (не в админке, а в клиентской части магазина).
//    Сценарий должен состоять из следующих частей:
//          1) регистрация новой учётной записи с достаточно уникальным адресом электронной почты
//           (чтобы не конфликтовало с ранее созданными пользователями),
//          2) выход (logout), потому что после успешной регистрации автоматически происходит вход,
//          3) повторный вход в только что созданную учётную запись,
//          4) и ещё раз выход.
//    Можно оформить сценарий либо как тест, либо как отдельный исполняемый файл.
//    Проверки можно никакие не делать, только действия -- заполнение полей, нажатия на кнопки и ссылки.
//    Если сценарий дошёл до конца, то есть созданный пользователь смог выполнить вход и выход --
//    значит создание прошло успешно.
//    В форме регистрации есть капча, её нужно отключить в админке учебного приложения на вкладке Settings -> Security.
}
